import 'package:flutter/material.dart';
import 'package:yehiwot_kal/models/Detail.dart';

class Details with ChangeNotifier {
  List<Detail> _details = [
    Detail(
        id: "1",
        title: "ከእጆቹ ማንም ሊነጥቀን አይችልም",
        img: AssetImage("assets/a1.jpeg"),
        date: "Jun 25",
        description:
            "'እኔ የዘላለም ሕይወት እሰጣቸዋለሁ፤ ከቶ አይጠፉም፤ ከእጄም ሊነጥቃቸው የሚችል ማንም የለም።' ዮሐ 10:28 ጌታችን ኢየሱስ ራሱን እንደ መልካም እረኛ ሲያስተዋውቀን የሰጠን ታላቅ ዋስትና ቢኖር ከእጁ ማንም ሊነጥቀን እንደማይችል ነው። እርሱ ወደ እርሱ የመጡትን ወደ ሜዳ አውጥቶ የማይጥል ብቻ ሳይሆን፣ በጥበቃው ጥላ ስር ለመኖር የመረጡትን ሁሉ በብርቱ ክንዶቹ የሚሸከም፣ ከማንኛውም አጥፊ ሃይል የሚታደግና የዘላለም ሕይወት የሚሰጥ ጌታ ነው። \n ይህንን እውነት ስናስተውል በምንም አይነት አስቸጋሪ ሁኔታ ውስጥ ብናልፍ 'ከእርሱ እጅ ሊነጥቀን እንደማይችል እርግጠኞች በመሆን እኛም ከጳውሎስ ጋር እንዲህ በማለት እናውጃለን፦'ከክርስቶስ ፍቅር የሚለየን ማን ነው? ችግር ነው ወይስ ሥቃይ፣ ወይስ ስደት፣ ወይስ ረሀብ፣ ወይስ ዕራቍትነት፣ ወይስ አደጋ ወይስ ሰይፍ?...ምንም አይለየንም፤ በዚህ ሁሉ በወደደን በእርሱ ከአሸናፊዎች እንበልጣለን። 38ይህን ተረድቻለሁ፤ ሞትም ይሁን ሕይወት፣ መላእክትም ይሁኑ አጋንንት፣ ያለውም ይሁን የሚመጣው፣ ወይም ማንኛውም ኀይል፣ ከፍታም ይሁን ጥልቀት፣ ወይም የትኛውም ፍጥረት፣ በጌታችን ኢየሱስ ክርስቶስ ካለው ከእግዚአብሔር ፍቅር ሊለየን አይችልም።” ሮሜ 8፡ 35፣ 37-40 \nአባት ሆይ፣ በእጆችህ እንደያዘከን ካንተም እጆች ማንም ሊነጥቀን እንደማይችል በማስተዋል ከስጋትና ከፍርሃት አምልጠን በሰላምና በእረፍት የተሞላ ሕይወት መኖር እንድንችል በጸጋህ እርዳን። አሜን።"),
    Detail(
        id: "2",
        title: "ከእጆቹ ማንም ሊነጥቀን አይችልም",
        img: AssetImage("assets/a1.jpeg"),
        date: "Jun 25",
        description:
            "'እኔ የዘላለም ሕይወት እሰጣቸዋለሁ፤ ከቶ አይጠፉም፤ ከእጄም ሊነጥቃቸው የሚችል ማንም የለም።' ዮሐ 10:28 ጌታችን ኢየሱስ ራሱን እንደ መልካም እረኛ ሲያስተዋውቀን የሰጠን ታላቅ ዋስትና ቢኖር ከእጁ ማንም ሊነጥቀን እንደማይችል ነው። እርሱ ወደ እርሱ የመጡትን ወደ ሜዳ አውጥቶ የማይጥል ብቻ ሳይሆን፣ በጥበቃው ጥላ ስር ለመኖር የመረጡትን ሁሉ በብርቱ ክንዶቹ የሚሸከም፣ ከማንኛውም አጥፊ ሃይል የሚታደግና የዘላለም ሕይወት የሚሰጥ ጌታ ነው። \n ይህንን እውነት ስናስተውል በምንም አይነት አስቸጋሪ ሁኔታ ውስጥ ብናልፍ 'ከእርሱ እጅ ሊነጥቀን እንደማይችል እርግጠኞች በመሆን እኛም ከጳውሎስ ጋር እንዲህ በማለት እናውጃለን፦'ከክርስቶስ ፍቅር የሚለየን ማን ነው? ችግር ነው ወይስ ሥቃይ፣ ወይስ ስደት፣ ወይስ ረሀብ፣ ወይስ ዕራቍትነት፣ ወይስ አደጋ ወይስ ሰይፍ?...ምንም አይለየንም፤ በዚህ ሁሉ በወደደን በእርሱ ከአሸናፊዎች እንበልጣለን። 38ይህን ተረድቻለሁ፤ ሞትም ይሁን ሕይወት፣ መላእክትም ይሁኑ አጋንንት፣ ያለውም ይሁን የሚመጣው፣ ወይም ማንኛውም ኀይል፣ ከፍታም ይሁን ጥልቀት፣ ወይም የትኛውም ፍጥረት፣ በጌታችን ኢየሱስ ክርስቶስ ካለው ከእግዚአብሔር ፍቅር ሊለየን አይችልም።” ሮሜ 8፡ 35፣ 37-40 \nአባት ሆይ፣ በእጆችህ እንደያዘከን ካንተም እጆች ማንም ሊነጥቀን እንደማይችል በማስተዋል ከስጋትና ከፍርሃት አምልጠን በሰላምና በእረፍት የተሞላ ሕይወት መኖር እንድንችል በጸጋህ እርዳን። አሜን።"),
    Detail(
        id: "3",
        title: "ከእጆቹ ማንም ሊነጥቀን አይችልም",
        img: AssetImage("assets/a1.jpeg"),
        date: "Jun 25",
        description:
            "'እኔ የዘላለም ሕይወት እሰጣቸዋለሁ፤ ከቶ አይጠፉም፤ ከእጄም ሊነጥቃቸው የሚችል ማንም የለም።' ዮሐ 10:28 ጌታችን ኢየሱስ ራሱን እንደ መልካም እረኛ ሲያስተዋውቀን የሰጠን ታላቅ ዋስትና ቢኖር ከእጁ ማንም ሊነጥቀን እንደማይችል ነው። እርሱ ወደ እርሱ የመጡትን ወደ ሜዳ አውጥቶ የማይጥል ብቻ ሳይሆን፣ በጥበቃው ጥላ ስር ለመኖር የመረጡትን ሁሉ በብርቱ ክንዶቹ የሚሸከም፣ ከማንኛውም አጥፊ ሃይል የሚታደግና የዘላለም ሕይወት የሚሰጥ ጌታ ነው። \n ይህንን እውነት ስናስተውል በምንም አይነት አስቸጋሪ ሁኔታ ውስጥ ብናልፍ 'ከእርሱ እጅ ሊነጥቀን እንደማይችል እርግጠኞች በመሆን እኛም ከጳውሎስ ጋር እንዲህ በማለት እናውጃለን፦'ከክርስቶስ ፍቅር የሚለየን ማን ነው? ችግር ነው ወይስ ሥቃይ፣ ወይስ ስደት፣ ወይስ ረሀብ፣ ወይስ ዕራቍትነት፣ ወይስ አደጋ ወይስ ሰይፍ?...ምንም አይለየንም፤ በዚህ ሁሉ በወደደን በእርሱ ከአሸናፊዎች እንበልጣለን። 38ይህን ተረድቻለሁ፤ ሞትም ይሁን ሕይወት፣ መላእክትም ይሁኑ አጋንንት፣ ያለውም ይሁን የሚመጣው፣ ወይም ማንኛውም ኀይል፣ ከፍታም ይሁን ጥልቀት፣ ወይም የትኛውም ፍጥረት፣ በጌታችን ኢየሱስ ክርስቶስ ካለው ከእግዚአብሔር ፍቅር ሊለየን አይችልም።” ሮሜ 8፡ 35፣ 37-40 \nአባት ሆይ፣ በእጆችህ እንደያዘከን ካንተም እጆች ማንም ሊነጥቀን እንደማይችል በማስተዋል ከስጋትና ከፍርሃት አምልጠን በሰላምና በእረፍት የተሞላ ሕይወት መኖር እንድንችል በጸጋህ እርዳን። አሜን።"),
  ];

  List<Detail> get details {
    return [..._details];
  }
}
